configuration/src/InformationRegisters/ПланируемыеТрудозатраты/ПланируемыеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланируемыеТрудозатраты</name>
  <resources>
    <name>Трудозатраты</name>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТрудозатрат</name>
    <type>
      <types>EnumRef.ТипыТрудозатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СвязьОбъектовСЗаявкамиНаРазработку/СвязьОбъектовСЗаявкамиНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьОбъектовСЗаявкамиНаРазработку</name>
  <resources>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </resources>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка_Новая</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередьСобытийНаОбработку/ОчередьСобытийНаОбработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьСобытийНаОбработку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <comment>Данные события в формате JSON</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Пользователь, инициировавший данное событие</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата обработки события</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <comment>Признак успешной обработки события</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатОбработки</name>
    <comment>Строка с описанием ошибки обработки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, к которому относится событие</comment>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.Спринт</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>DocumentRef.ВнутренниеТрудозатраты</types>
      <types>DocumentRef.ОбработкаЭскалацииОшибок</types>
      <types>CatalogRef.Продукты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.КарточкаКанбан</types>
      <types>CatalogRef.Процессы</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытийОчереди</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <comment>Для обеспечения уникальности записей</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПланируемыеТрудозатраты/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Объект = Отбор.Объект.Значение;
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаявкаНаРазработку") Тогда
		Заявка = Объект;
	Иначе
		Заявка = РегистрыСведений.СвязьОбъектовСЗаявкамиНаРазработку.ПолучитьЗаявку(Объект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявка) Тогда 
		РегистрыСведений.ОчередьСобытийНаОбработку.ПересчитатьПлановыеТрудозатраты(Заявка);
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти
